# Exerc√≠cios - An√°lise de Dados üïµüèΩ üé≤ em Alto Desempenho üöÄ üßû‚Äç‚ôÇÔ∏è

## Manipulando dados do Titanic 

### Importando e examinando os dados

Carregue um arquivo .csv em um DataFrame e execute as seguintes a√ß√µes:
1. Examine as 5 primeiras linhas e as 5 √∫ltimas linhas.
2. Visualize a informa√ß√£o b√°sica sobre o DataFrame, incluindo o n√∫mero de valores n√£o nulos, os tipos dos dados das colunas e o quanto de mem√≥ria o DataFrame utiliza.
3. Use a fun√ß√£o **describe()** para visualizar o resumo estat√≠stico dos dados.

Use o conjunto de dados do "Titanic", um dataset famoso no aprendizado de *machine learning* e estat√≠stica, dispon√≠vel na seguinte url:

```
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
```

In [10]:
#caso queira baixar o arquivo .csv para a sua maquina
!wget "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

--2023-09-21 20:33:55--  https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 2606:50c0:8000::154, 2606:50c0:8002::154, 2606:50c0:8003::154, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|2606:50c0:8000::154|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 60302 (59K) [text/plain]
Saving to: ‚Äòtitanic.csv‚Äô

titanic.csv         100%[===================>]  58.89K  --.-KB/s    in 0.01s

2023-09-21 20:33:55 (5.84 MB/s) - ‚Äòtitanic.csv‚Äô saved [60302/60302]

In [44]:
import pandas as pd

# Carregando o DataFrame direto da url
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

# ou carregando da maquina local, apos baixa-lo
#url = 'titanic.csv'

titanic_df = pd.read_csv(url)

In [14]:
# Examinando o DataFrame
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [16]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Indexa√ß√£o e *slicing*

Utilizando o dataframe contendo dados do Titanic, realize as seguintes opera√ß√µes:
1. Selecione uma coluna pelo seu nome e visualize o seu conte√∫do.
2. Selecione m√∫ltiplas colunas pelos seus nomes e visualize o seu conte√∫do.
3. Filtre as linhas do dataframe em que os passageiros eram crian√ßas, ou seja, tinham idade menor ou igual a 12.
3. Use a fun√ß√£o **iloc** para selecionar o intervalo de linhas [10,20].

In [18]:
titanic_df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

### Opera√ß√µes b√°sicas sobre os dados

Realize as seguintes opera√ß√µes:
1. Encontre os valores de passagem mais baratos e mais caros pagos pelos passageiros do Titanic. Use as fun√ß√µes **idxmin()** e **idxmax()** para tal.
2. Calcule a m√©dia de idade dos passageiros do Titanic.

Confira sua resposta com a sa√≠da da fun√ß√£o **describe()**.

In [35]:
idx_mais_barato = titanic_df['Fare'].idxmin()
valor_mais_barato = titanic_df.iloc[idx_mais_barato,9]
print(f'O valor mais barato de passagem pago por um passageiro foi {valor_mais_barato}.')

idx_mais_caro = titanic_df['Fare'].idxmax()
valor_mais_caro = titanic_df.iloc[idx_mais_caro,9]
print(f'O valor mais caro de passagem pago por um passageiro foi {valor_mais_caro}.')

O valor mais barato de passagem pago por um passageiro foi 0.0.
O valor mais caro de passagem pago por um passageiro foi 512.3292.

In [40]:
media_idades = titanic_df['Age'].mean(skipna=True)
print(f'A m√©dia de idade dos passageiros do Titanic era {media_idades}.')

A m√©dia de idade dos passageiros do Titanic era 29.69911764705882.

### Opera√ß√µes b√°sicas sobre o DataFrame

Realize as seguintes opera√ß√µes sobre o dataframe contendo dados do Titanic.

1. Voc√™ percebe que as colunas **SibSp**, **Parch**, **Cabin**, **Ticket** e **Embarked** n√£o contribuem para a sua an√°lise dos dados do conjunto. Exclua essas colunas do dataframe.
2. Tamb√©m acha que os nomes das colunas n√£o est√£o legais. Mude os nomes das colunas do ingl√™s para o portugu√™s.

In [45]:
titanic_df.drop(columns = ['SibSp','Parch','Cabin','Embarked','Ticket'], inplace=True)
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500
...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500

In [46]:
titanic_df.rename(columns={'PassengerId':'IdPassageiro', 'Survived':'Sobreviveu', 'Pclass':'Classe', 'Name':'Nome',
                 'Sex':'Sexo', 'Age':'Idade', 'Fare':'ValorPassagem'}, inplace=True)
titanic_df

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,ValorPassagem
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500
...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500